; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-39)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 ball38 ball39 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(ball ball38)
(ball ball39)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room3)
(at ball30 room4)
(at ball31 room4)
(at ball32 room4)
(at ball33 room4)
(at ball34 room4)
(at ball35 room4)
(at ball36 room4)
(at ball37 room4)
(at ball38 room4)
(at ball39 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 room3)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room3)
(at ball30 room3)
(at ball31 room3)
(at ball32 room3)
(at ball33 room3)
(at ball34 room3)
(at ball35 room3)
(at ball36 room3)
(at ball37 room3)
(at ball38 room3)
(at ball39 room3)
)
)
)

; plan
1. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 10 of 39
2. (pick ball6 rooma right)
   deleted: (at ball6 rooma) (free right)
   added: (carry ball6 right)
   goals met: 10 of 39
3. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 10 of 39
4. (drop ball6 room3 right)
   deleted: (carry ball6 right)
   added: (at ball6 room3) (free right)
   goals met: 11 of 39
5. (drop ball7 room3 left)
   deleted: (carry ball7 left)
   added: (at ball7 room3) (free left)
   goals met: 12 of 39
6. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 12 of 39
7. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 12 of 39
8. (pick ball8 roomb right)
   deleted: (at ball8 roomb) (free right)
   added: (carry ball8 right)
   goals met: 12 of 39
9. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 12 of 39
10. (drop ball8 room3 right)
   deleted: (carry ball8 right)
   added: (at ball8 room3) (free right)
   goals met: 13 of 39
11. (drop ball9 room3 left)
   deleted: (carry ball9 left)
   added: (at ball9 room3) (free left)
   goals met: 14 of 39
12. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 14 of 39
13. (pick ball19 roomb left)
   deleted: (at ball19 roomb) (free left)
   added: (carry ball19 left)
   goals met: 14 of 39
14. (pick ball18 roomb right)
   deleted: (at ball18 roomb) (free right)
   added: (carry ball18 right)
   goals met: 14 of 39
15. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 14 of 39
16. (drop ball18 room3 right)
   deleted: (carry ball18 right)
   added: (at ball18 room3) (free right)
   goals met: 15 of 39
17. (drop ball19 room3 left)
   deleted: (carry ball19 left)
   added: (at ball19 room3) (free left)
   goals met: 16 of 39
18. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 16 of 39
19. (pick ball17 roomb left)
   deleted: (at ball17 roomb) (free left)
   added: (carry ball17 left)
   goals met: 16 of 39
20. (pick ball16 roomb right)
   deleted: (at ball16 roomb) (free right)
   added: (carry ball16 right)
   goals met: 16 of 39
21. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 16 of 39
22. (drop ball16 room3 right)
   deleted: (carry ball16 right)
   added: (at ball16 room3) (free right)
   goals met: 17 of 39
23. (drop ball17 room3 left)
   deleted: (carry ball17 left)
   added: (at ball17 room3) (free left)
   goals met: 18 of 39
24. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 18 of 39
25. (pick ball15 roomb left)
   deleted: (at ball15 roomb) (free left)
   added: (carry ball15 left)
   goals met: 18 of 39
26. (pick ball14 roomb right)
   deleted: (at ball14 roomb) (free right)
   added: (carry ball14 right)
   goals met: 18 of 39
27. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 18 of 39
28. (drop ball14 room3 right)
   deleted: (carry ball14 right)
   added: (at ball14 room3) (free right)
   goals met: 19 of 39
29. (drop ball15 room3 left)
   deleted: (carry ball15 left)
   added: (at ball15 room3) (free left)
   goals met: 20 of 39
30. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 20 of 39
31. (pick ball13 roomb left)
   deleted: (at ball13 roomb) (free left)
   added: (carry ball13 left)
   goals met: 20 of 39
32. (pick ball12 roomb right)
   deleted: (at ball12 roomb) (free right)
   added: (carry ball12 right)
   goals met: 20 of 39
33. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 20 of 39
34. (drop ball12 room3 right)
   deleted: (carry ball12 right)
   added: (at ball12 room3) (free right)
   goals met: 21 of 39
35. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 22 of 39
36. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 22 of 39
37. (pick ball11 roomb left)
   deleted: (at ball11 roomb) (free left)
   added: (carry ball11 left)
   goals met: 22 of 39
38. (pick ball10 roomb right)
   deleted: (at ball10 roomb) (free right)
   added: (carry ball10 right)
   goals met: 22 of 39
39. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 22 of 39
40. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 22 of 39
41. (drop ball10 room3 right)
   deleted: (carry ball10 right)
   added: (at ball10 room3) (free right)
   goals met: 23 of 39
42. (drop ball11 room3 left)
   deleted: (carry ball11 left)
   added: (at ball11 room3) (free left)
   goals met: 24 of 39
43. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 24 of 39
44. (pick ball39 room4 left)
   deleted: (at ball39 room4) (free left)
   added: (carry ball39 left)
   goals met: 24 of 39
45. (pick ball38 room4 right)
   deleted: (at ball38 room4) (free right)
   added: (carry ball38 right)
   goals met: 24 of 39
46. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 24 of 39
47. (drop ball38 room3 right)
   deleted: (carry ball38 right)
   added: (at ball38 room3) (free right)
   goals met: 25 of 39
48. (drop ball39 room3 left)
   deleted: (carry ball39 left)
   added: (at ball39 room3) (free left)
   goals met: 26 of 39
49. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 26 of 39
50. (pick ball37 room4 left)
   deleted: (at ball37 room4) (free left)
   added: (carry ball37 left)
   goals met: 26 of 39
51. (pick ball36 room4 right)
   deleted: (at ball36 room4) (free right)
   added: (carry ball36 right)
   goals met: 26 of 39
52. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 26 of 39
53. (drop ball36 room3 right)
   deleted: (carry ball36 right)
   added: (at ball36 room3) (free right)
   goals met: 27 of 39
54. (drop ball37 room3 left)
   deleted: (carry ball37 left)
   added: (at ball37 room3) (free left)
   goals met: 28 of 39
55. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 28 of 39
56. (pick ball35 room4 left)
   deleted: (at ball35 room4) (free left)
   added: (carry ball35 left)
   goals met: 28 of 39
57. (pick ball34 room4 right)
   deleted: (at ball34 room4) (free right)
   added: (carry ball34 right)
   goals met: 28 of 39
58. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 28 of 39
59. (drop ball34 room3 right)
   deleted: (carry ball34 right)
   added: (at ball34 room3) (free right)
   goals met: 29 of 39
60. (drop ball35 room3 left)
   deleted: (carry ball35 left)
   added: (at ball35 room3) (free left)
   goals met: 30 of 39
61. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 30 of 39
62. (pick ball33 room4 left)
   deleted: (at ball33 room4) (free left)
   added: (carry ball33 left)
   goals met: 30 of 39
63. (pick ball32 room4 right)
   deleted: (at ball32 room4) (free right)
   added: (carry ball32 right)
   goals met: 30 of 39
64. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 30 of 39
65. (drop ball32 room3 right)
   deleted: (carry ball32 right)
   added: (at ball32 room3) (free right)
   goals met: 31 of 39
66. (drop ball33 room3 left)
   deleted: (carry ball33 left)
   added: (at ball33 room3) (free left)
   goals met: 32 of 39
67. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 32 of 39
68. (pick ball31 room4 left)
   deleted: (at ball31 room4) (free left)
   added: (carry ball31 left)
   goals met: 32 of 39
69. (pick ball30 room4 right)
   deleted: (at ball30 room4) (free right)
   added: (carry ball30 right)
   goals met: 32 of 39
70. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 32 of 39
71. (drop ball30 room3 right)
   deleted: (carry ball30 right)
   added: (at ball30 room3) (free right)
   goals met: 33 of 39
72. (drop ball31 room3 left)
   deleted: (carry ball31 left)
   added: (at ball31 room3) (free left)
   goals met: 34 of 39
73. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 34 of 39
74. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 34 of 39
75. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 34 of 39
76. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 34 of 39
77. (drop ball4 room3 right)
   deleted: (carry ball4 right)
   added: (at ball4 room3) (free right)
   goals met: 35 of 39
78. (drop ball5 room3 left)
   deleted: (carry ball5 left)
   added: (at ball5 room3) (free left)
   goals met: 36 of 39
79. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 36 of 39
80. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 36 of 39
81. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 36 of 39
82. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 36 of 39
83. (drop ball2 room3 right)
   deleted: (carry ball2 right)
   added: (at ball2 room3) (free right)
   goals met: 37 of 39
84. (drop ball3 room3 left)
   deleted: (carry ball3 left)
   added: (at ball3 room3) (free left)
   goals met: 38 of 39
85. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 38 of 39
86. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 38 of 39
87. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 38 of 39
88. (drop ball1 room3 left)
   deleted: (carry ball1 left)
   added: (at ball1 room3) (free left)
   goals met: 39 of 39
